package section_9_if_statement_with_a_complex_condition;

public class Task_9_3 {

    public void action() {
        /*
            Задание: Запиши в форме, принятой в языке Java, следующие условия, выраженные
            в таблице в словесной форме.

            -------------------------------------------------------------------------
            |     Словесная форма условия       |               Java                 |
            --------------------------------------------------------------------------
            | Значение переменной больше 90,    |          a > 90 && a < 100         |
            | но меньше 100                     |                                    |
            --------------------------------------------------------------------------
            | Сумма двух значений переменных    |     a + b > 100 && a + b < 200     |
            | больше 100, но не превышает 200   |                                    |
            --------------------------------------------------------------------------
            | Значение переменной делится (без  |      a / 3 == 0 && a / 4 == 0      |
            | остатка) и на 3, и на 4           |                                    |
            --------------------------------------------------------------------------
            | Значение переменной - четное, но  |      a % 2 == 0 && a % 10 != 0     |
            | не заканчивается на 0             |                                    |
            --------------------------------------------------------------------------
            | Значение переменной делится       |      a % 3 == 0 && a % 4 != 0      |
            | на 3, но не делится на 4          |                                    |
            --------------------------------------------------------------------------
            | Значение переменной делится на 5  |                                    |
            | с остатком 2, а на 3 делится с    |     a % 5 == 2 && a % 3 == 1       |
            | остатком 1                        |                                    |
            --------------------------------------------------------------------------
            | Одна из цифр двузначного целого   |                                    |
            | числа (значения переменной)       |     a / 10 == 3 || a % 10 == 3     |
            | равна 3                           |                                    |
            --------------------------------------------------------------------------
            | Значение переменной представляет  |          a >= 2 && a <= 5          |
            | собой «правильную» оценку         |                                    |
            --------------------------------------------------------------------------
            | Ученик получил как минимум 4 и по |         a >= 4 && b >= 4           |
            | английскому, и по математике      |                                    |
            --------------------------------------------------------------------------
         */
    }
}
