package section_9_if_statement_with_a_complex_condition;

public class Task_9_1 {

    public void action() {
        /*
            Задание: Дано составное условие с переменными типа int: (a > 10 && b > 100)

            1. Заполните таблицу:
            -------------------------------------------------------
            |      a       |  20  |   6   |  28   |   10  |   10  |
            |      b       |  231 |  131  |  87   |   10  |   31  |
            | Зн.Выражения | true | false | false | false | false |
            -------------------------------------------------------

            2. Для каких значений переменной а значение выражения всегда будет false?
            ------------------------------------------------------------------------------------------
            При a <= 10 всегда будет false
         */
    }
}
