package section_9_if_statement_with_a_complex_condition;

public class Task_9_2 {

    public void action() {
        /*
            Задание: Дано составное условие с переменными типа int: (a > 10 || b > 10)

            1. Заполните таблицу:
            -------------------------------------------------------
            |      a       |  20  |   6   |  28   |   10  |   10  |
            |      b       |  31  |  100  |   8   |   10  |   1   |
            | Зн.Выражения | true | true  | true  | false | false |
            -------------------------------------------------------

            2. Для каких значений переменной а значение выражения всегда будет true?
            ------------------------------------------------------------------------------------------
            При a >= 11 всегда будет true
         */
    }
}
