package section_18_array_description_initialization_properties;

/*
    Примечание: В заданиях №1 - 8 используется следующее описание массива:
    int n = 5;
    int[] а = new int[n];
 */
public class Task_18_1 {

    public void action() {
        /*
            Задание: Укажите, какие значения будет содержать массив, после выполнения следующего блока:
            for (i = 0; i < n; i++)
                a[i] = i * (i + 1);
            ------------------------------------------------------------------------------------------
            Массив будет содержать следующие значения: 0, 2, 6, 12, 20
         */
    }
}
