package section_18_array_description_initialization_properties;

public class Task_18_9 {

    public void method() {
        /*
            Задание: Укажите, какие значения будет содержать массив, после выполнения
            следующего блока (используйте таблицу трассировки):
            a[0] = 1; a[1] = 1;
            for (i = 2; i < n; i++)
                a[i] = a[i - 1] + a[i - 2];

            ------------------------------------------------------------------------------------------
            Массив будет содержать следующие элементы: [1, 1, 2, 3, 5,]
         */
    }
}
