package section_18_array_description_initialization_properties;

public class Task_18_5 {

    public void method() {
        /*
            Задание: Укажите, какие значения будет содержать массив, после выполнения
            следующего блока (случайные числа, генерируемые в блоке, выберите
            самостоятельно в соответствии с указанными в команде границами,
            используйте таблицу трассировки):
            for(i = 0; i < n; i = i + 2) {
                x = (int) (90 * Math.random() + 10);
                a[i] = x % 10;
                a[i + 1] = x / 10;
            }

            Массив будет содержать следующие числа: 8, 8, 3, 4 и ошибка - IndexOutOfBoundsException
         */
    }
}
