package section_18_array_description_initialization_properties;

public class Task_18_6 {

    public void method() {
        /*
            Задание: Укажите, какие значения будет содержать массив, после выполнения
            следующего блока (случайное число, генерируемое в блоке, выберите
            самостоятельно в соответствии с указанными в команде границами,
            используйте таблицу трассировки):
            x = (int) (Math.random() * 99 + 1);
            for (i = O; i < n; i++) {
                a[i] = x;
                x = x + x % 10;
            }

            x = 68, массив содержит следующие значения: [63, 66, 72, 74, 78]
         */
    }
}
