package section_18_array_description_initialization_properties;

public class Task_18_4 {

    public void method() {
        /*
            Задание: Укажите, какие значения будет содержать массив, после выполнения
            следующего блока (случайные числа, генерируемые в блоке, выберите
            самостоятельно в соответствии с указанными в команде границами,
            используйте таблицу трассировки):
            for(i = 0; i < n; i++) {
                x = (int) (90 * Math.random() + 10);
                a[i] = x / 10;
            }

            Таблица:
            -------------------------------------------
            | Сгенерированное число | Элемент массива |
            |           38          |        3        |
            |           44          |        4        |
            |           93          |        9        |
            |           70          |        7        |
            |           85          |        8        |
            -------------------------------------------
         */
    }
}
