package section_18_array_description_initialization_properties;

public class Task_18_8 {

    public void method() {
        /*
            Задание: Укажите, какие значения будет содержать массив, после выполнения
            следующего блока (данные, вводимые с клавиатуры, выберите самостоятельно,
            используйте таблицу трассировки):
            for (i = 0; i < n / 2; i++) {
                x = reader.nextInt();
                a[i] = x;
                a[n - 1 - i] = a[i];
            }

            ------------------------------------------------------------------------------------------
            Для вводимых значений 5 и 7 массив будет содержать следующие элементы:
            [5, 7, 0, 7, 5].
         */
    }
}
