package section_18_array_description_initialization_properties;

public class Task_18_2 {

    public void action() {
        /*
            Задание: Укажите, какие значения будет содержать массив, после выполнения
            следующего блока (данные, вводимые с клавиатуры, выберите самостоятельно,
            используйте таблицу трассировки):
            for (i = 0; i < n; i++) {
                x = reader.nextInt();
                a[i] = x % 2;
            }

            Таблица:
            ---------------------------------------
            | Ввод с клавиатуры | Элемент массива |
            |        5          |        1        |
            |        6          |        0        |
            |       23          |        1        |
            |       58          |        0        |
            |       55          |        1        |
            ---------------------------------------
         */
    }
}
