package section_18_array_description_initialization_properties;

public class Task_18_3 {

    public void method() {
        /*
            Задание: Укажите, какие значения будет содержать массив, после выполнения
            следующего блока (данные, вводимые с клавиатуры, выберите самостоятельно,
            используйте таблицу трассировки):
            for(i = 1; i < n; i++) {
                x=reader.nextInt();
                a[i]= x % i;
            }

            Таблица:
            ---------------------------------------
            | Ввод с клавиатуры | Элемент массива |
            |        5          |        0        |
            |        7          |        1        |
            |        3          |        0        |
            |       15          |        3        |
            ---------------------------------------
         */
    }
}
