package section_18_array_description_initialization_properties;

public class Task_18_7 {

    public void method() {
        /*
            Задание: Укажите, какие значения будет содержать массив, после выполнения
            следующего блока (случайные числа, генерируемые в блоке, выберите
            самостоятельно в соответствии с указанными в команде границами,
            используйте таблицу трассировки):
            x = (int) (Math.random() * 100);
            for (i = 0; i < n; i++) {
                a[i] = x;
                x = (int) (x + Math.random() * 100);
            }

            Таблица:
            -------------------------------------------
            | Сгенерированное число | Элемент массива |
            |           16          |       16        |
            |           19          |       19        |
            |           29          |       29        |
            |          106          |       85        |
            |           85          |       106        |
            -------------------------------------------
         */
    }
}
