package section1_variables_and_the_main_types_of_variables_declaring_and_initializing_variables;

public class Task1_2 {


    public void action() {
    /*
        Задание: Перед вами примеры объявления переменных и их инициализации.
        Укажите, какие из них правильные, а какие - ошибочные. Обоснуйте каждый ответ.
        ------------------------------------------------------------------------------------------
        Ошибок нет, инициализация переменной выполнена верно
        int x;
        x = - 5;
        ------------------------------------------------------------------------------------------
        Ошибка компиляции, в переменную типа int с идентификатором a
        пытаются положить вещественное число.
        Инициализация переменной b выполнена верно
        int a = 0.0, b = 7;
        ------------------------------------------------------------------------------------------
        Ошибок нет, инициализация переменных выполнена верно
        int b = 3;
        double c;
        c = 5.0;
        ------------------------------------------------------------------------------------------
        Синтаксическая ошибка при присваивании чего-то переменной b, остальные действия выполнены верно
        int a, b, c = 5;
        b = 5c;
        a = - b;
        ------------------------------------------------------------------------------------------
        Ошибка компиляции, повторное объявление переменной b
        double a = 3.6, b;
        int b = 4;
        ------------------------------------------------------------------------------------------
    */
    }
}
