package section1_variables_and_the_main_types_of_variables_declaring_and_initializing_variables;

public class Task1_4 {

    public void example1_4() {
        /*
            Задание: Напишите фрагмент класса (группу команд), который будет присваивать
            значения 5 и 9 двум переменным, а затем третья переменная будет
            получать значение, равное сумме значений первых двух переменных.
            ------------------------------------------------------------------------------------------
            int a = 5, b = 9;
            int c = a + b;
         */
    }
}
