package section1_variables_and_the_main_types_of_variables_declaring_and_initializing_variables;

public class Task1_1 {

    public void example1_1() {
    /*
        Задание: Перед вами примеры объявления переменных. Укажите, какие из них
        правильные, а какие - ошибочные. Обоснуйте каждый ответ.
        ------------------------------------------------------------------------------------------
        Есть следующие правила идентификаторов Java:
        • все идентификаторы начинаются с латинской буквы (от A до Z или от a до z),
        символа валюты ($) или символа подчеркивания (_);
        • после первого символа у идентификаторов может быть любая комбинация символов;
        • ключевое слово Java не может быть идентификатором;
        • идентификаторы чувствительны к регистру.
        ------------------------------------------------------------------------------------------
        Ошибка компиляции. Идентификатор переменной не может начинаться с цифры
        int 1x; - идентификатор переменной не может начинаться с цифры
        ------------------------------------------------------------------------------------------
        Ошибка компиляции. Идентификаторы переменных в одной области видимости должны отличаться
        double t;
        int t;
        ------------------------------------------------------------------------------------------
        Ошибка компиляции. Идентификаторы переменных в одной области видимости должны отличаться
        int f, f;
        ------------------------------------------------------------------------------------------
        Ошибок в объявлении переменных x и X нет, соблюдены все правила идентификаторов
        int x, X;

        Ошибка компиляция, пропущен тип переменной a1
        double a; a1;
        ------------------------------------------------------------------------------------------
        Ошибка компиляции , пропущен тип переменной kniga2
        String kniga1; kniga2;
        ------------------------------------------------------------------------------------------
        Ошибок в объявлении переменных нет, соблюдены все правила идентификаторов
        char znak1, znak2, znak_1;
        ------------------------------------------------------------------------------------------
        Ошибок в объявлении переменных нет, соблюдены все правила идентификаторов
        int x, a, b;
        double y, z, x;
        ------------------------------------------------------------------------------------------
        Ошибок в объявлении переменных нет, соблюдены все правила идентификаторов
        int x;
        double X;
        ------------------------------------------------------------------------------------------
    */
    }
}