package section1_variables_and_the_main_types_of_variables_declaring_and_initializing_variables;

public class Task1_3 {

    public void example1_3() {
        /*
            Задание: Перед вами словесные описания объявления и инициализации переменных.
            Запишите их в правилах языка Java - в разных допустимых вариантах.
            ------------------------------------------------------------------------------------------
            Описание: Переменная x (типа "просто целое") получает значение 16

            Ответ:
            int x = 16;
            ИЛИ
            int x;
            x = 16;
            ------------------------------------------------------------------------------------------
            Описание: Переменные x и t относятся к типу "простое целое", при этом
            значение переменной x равно -2

            Ответ:
            int x = -2, t;
            ИЛИ
            int x, t;
            x = -2;
            ------------------------------------------------------------------------------------------
            Описание: Переменные t и f относятся к "вещественному типу", при этом
            переменная t имеет значение 5.5, а значение переменной f в 10 раз
            больше значения переменной t

            Ответ:
            double t = 5.5, f = 10 * t;
            ИЛИ
            double t, f;
            t = 5.5;
            f = 10 * t;
            ------------------------------------------------------------------------------------------
         */
    }
}
