package section1_variables_and_the_main_types_of_variables_declaring_and_initializing_variables;

public class Task_1_6 {

    public void action() {
        /*
            Задание: Напишите фрагмент класса, в котором переменным а и b будут присваиваться
            числовые значения из диапазона «однозначное положительное число».
            Затем следует присвоить переменной c значение, составленное следующим образом:
            значение переменной а является числом десятков,
            значение переменной b является числом единиц.
            Например, если переменной а присваивается значение 4,
            а переменной b - значение 7, то переменная с получает значение 47.
            ------------------------------------------------------------------------------------------
            int a = 8;
            int b = 2;
            int c = a * 10 + b;
         */
    }
}
