package section_11_for_loop;

public class Task_11_3 {

    public void action() {
        /*
            Задание: Дан программный блок (часть класса):
            int sum = 0;
            for (int i = 1; i < 6; i++) {
                int k = in.nextInt();
                if (k > 100) sum += k;
            }
            System.out.println(sum);

            Постройте таблицу ручной прокрутки (таблицу трассировки) и укажите,
            что будет выведено на экран, если в качестве ввода были использованы
            следующие значения: 27, 130, 200, 72, 89.

            Таблица:
            --------------------
            | Введено | Вывод  |
            --------------------
            |   27    |        |
            |   130   |        |
            |   200   |        |
            |   72    |        |
            |   89    |        |
            --------------------
            Ответ: 300
         */
    }
}
