package section_11_for_loop;

public class Task_11_2 {

    public void action() {
        /*
            Задание: Даны описания заголовков циклов. Напишите эти заголовки на языке Java.

            1. Цикл выполняется 17 раз, начальное значение переменной-счетчика равно 12.
               ------------------------------------------------------------------------------------------
               for (int i = 12; i <= 28; i++)


            2. Цикл выполняется 7 раз, конечное значение переменной-счетчика равно 45.
               ------------------------------------------------------------------------------------------
               for (int i = 5; i <= 45; i += 7)


            3. Цикл выполняется 300 раз, начальное значение переменной-счетчика
               равно 1, ее значение должно увеличиваться каждый раз на 5.
               ------------------------------------------------------------------------------------------
               for (int i = 1; i <= 1500; i += 5)


            4. Цикл выполняется 20 раз, начальное значение переменной-счетчика
               равно 1, ее значение должно уменьшаться каждый раз на 10.
               ------------------------------------------------------------------------------------------
               for (int i = 1; i >= -190; i -= 10)


            5. Цикл выполняется 300 раз, конечное значение переменной-счетчика
               равно 1, ее значение должно уменьшаться каждый раз на 1.
               ------------------------------------------------------------------------------------------
               for (int i = 300; i >= 1; i--)


            6. Цикл выполняется 25 раз, конечное значение переменной-счетчика
               равно 1, ее значение должно уменьшаться каждый раз на 7.
               ------------------------------------------------------------------------------------------
               for (int i = 175; i >= 1; i -= 7)
         */
    }
}
