package section8_simple_if_with_block;

public class Task_8_3 {

    public void action() {
        /*
            Задание: Дан класс:

            import java.util.*;

            class ех3 {
                static Scanner reader = new Scanner(System.in);

                public static void main(String[] args) {
                    System.out.print("Bвeди целое двузначное число=");
                    int а, b, с;
                    a = reader.nextInt();
                    b = а / 10;
                    с = а % 10;

                    if (b == с)
                        System.out.println("Yes");
                    else
                        System.out.println("No");

                    if (b > с)
                        System.out.println("Good");
                    else
                        System.out.println("Bad");
                }
            }

            1. Какие сообщения будут выводиться на экран, если с клавиатуры
               введено значение 21?
               ------------------------------------------------------------------------------------------
               No
               Good


            2. Какие сообщения будут выводиться на экран, если с клавиатуры
               введено значение 12?
               ------------------------------------------------------------------------------------------
               No
               Bad


            3. Какие сообщения будут выводиться на экран, если с клавиатуры
               введено значение 22?
               ------------------------------------------------------------------------------------------
               Yes
               Bad


            4. Предложите более соответствующие общему смыслу программы
               сообщения, которые должен выводить на экран класс. Объясните свой выбор.
               ------------------------------------------------------------------------------------------
               Первая цифра не равна последней цифре и наоборот
               Первая цифра больше второй цифры и наоборот


            5. Будут ли предложенные изменения соответствовать смыслу, если
               с клавиатуры будет введено значение 367? Объясните свой ответ.
               ------------------------------------------------------------------------------------------
               Нет


            6. Будут ли предложенные изменения соответствовать смыслу, если
               с клавиатуры будет введено значение 8? Объясните свой ответ.
               ------------------------------------------------------------------------------------------
               Нет
         */
    }
}
