package section8_simple_if_with_block;

public class Task_8_9 {

    public void action() {
        /*
            Задание: Дан фрагмент класса (программный блок):

            if (a % 2 != 1) {
                b = a / 2;
                c = (a + b) % 10;
                System.out.println("b: " + b + "\n" + "c: " + c);
                System.out.println("Результат: " + (a + b + c));
            } else {
                b = a / 2 + 1;
                c = (a * b) % 10;
                System.out.println("b: " + b + "\n" + "c: " + c);
                System.out.println("Результат: " + (c - a - b));
            }

            Заполните таблицу в соответствии с исполнением этого фрагмента:
            -----------------------------------------------------------------------------
            |    a     | 3000 |  129  |  7 | 45  | 10 |  18  |  16   |  13   |  15  |
            |    b     | 1500 |   65  |  4 | 23  |  5 |  9   |   8   |   7   |   8  |
            |    c     |  0   |   5   |  8 | 5   |  5 |  7   |   4   |   1   |   0  |
            | На экран | 4500 |  -189 | -3 | -63 | 20 |  34  |  28   |  -19  | -23  |
            -----------------------------------------------------------------------------

         */
    }
}
