package section8_simple_if_with_block;

public class Task_8_8 {

    public void action() {
        /*
            Задание: Дан фрагмент класса (программный блок):
            int a = reader.nextInt();
            int b = reader.nextInt();
            int c = a / 2 + b / 2;

            if (a + b != c) {
                c = a / 2 + b / 2;
                System.out.println("C=" + c);
            } else {
                c = a % 2 + b % 2;
                System.out.println("C is " + c);
            }

            Заполните таблицу в соответствии с исполнением этого фрагмента:
            -----------------------------------------------------------------------------
            | Ввод с клавиатуры |  a  |  b  | Значение переменной C | Вывод на экран    |
            |                   |     |     | начальное | конечное  |                   |
            -----------------------------------------------------------------------------
            | 5 8               |  5  |  8  |     6     |     6     |     C = 6         |
            | 4 6               |  4  |  6  |     5     |     5     |     C = 5         |
            | 3 7               |  3  |  7  |     4     |     4     |     C = 4         |
            -----------------------------------------------------------------------------
         */
    }
}
