package section8_simple_if_with_block;

/*
    Задание:
 */
public class Task_8_2 {

    public void action() {
        /*
            Задание: import java.util.*;

            class ех2 {
                static Scanner reader = new Scanner(System.in);

                public static void main(String[] args) {
                    System.out.print("Bвeди целое число=");
                    int a = reader.nextInt();
                    System.out.print("Bвeди еще одно целое число=");
                    int b = reader.nextInt();

                    if (а % b == 0)
                        System.out.println("Yes");
                    else
                        System.out.println("No");

                    if (b % a == 0) {
                        а += 2;
                        System.out.println("Good");
                    } else {
                        а = 2;
                        System.out.println("Bad");
                    }
                    System.out.println(a);
                }
            }

            1. Заполните таблицу в соответствии с исполнением операторов.
               --------------------------------------
               | Ввод с клавиатуры | Вывод на экран |
               |     3     21      | No Good 5      |
               |    21      3      | Yes Bad 2      |
               |    13     13      | Yes Good 15    |
               |     5     12      | No Bad 2       |
               --------------------------------------


            2. Предложите более соответствующие общему смыслу программы
               сообщения, которые должен выводить на экран класс. Объясните свой выбор.
               ------------------------------------------------------------------------------------------
               a делится на b без остатка и a не делится на b без остатка
               b делится на a без остатка и b не делится на a без остатка


            3. Какие значения, введенные с клавиатуры, приведут (на этапе исполнения)
               к сообщению об ошибке?
               ------------------------------------------------------------------------------------------
               0, будет ArithmeticException


         */
    }
}
