package section8_simple_if_with_block;

public class Task_8_4 {

    public void action() {
        /*
            Задание: Дан оператор выбора:
            if (х / 10 >= 5) t = 20; else t = O;

            1. Каким будет, после выполнения оператора, значение переменной
               t, если значение переменной х равно 59?
               ------------------------------------------------------------------------------------------
               20


            2. Каким будет, после выполнения оператора, значение переменной
               t, если значение переменной х равно 8?
               ------------------------------------------------------------------------------------------
               0


            3. Каким будет, после выполнения оператора, значение переменной
               t, если значение переменной х равно 21?
               ------------------------------------------------------------------------------------------
               0


            4. Каким было значение переменной х, если после выполнения оператора
               значение переменной t равно 20?
               Если есть несколько вариантов ответа, достаточно привести один из них.
               ------------------------------------------------------------------------------------------
               78


            5. Каким было значение переменной х, если после выполнения оператора
               значение переменной t равно О? Если есть несколько вариантов
               ответа, достаточно привести один из них.
               ------------------------------------------------------------------------------------------
               23


            6. Напишите словесное описание оператора.
               ------------------------------------------------------------------------------------------
               Если x, делённый на 10, больше 5, то t равняется 20, иначе t равняется 0
         */
    }
}
