package section8_simple_if_with_block;

public class Task_8_6 {

    public void action() {
        /*
            Задание: Перед вами фрагмент программы, включающий два условных оператора.
            Заполните таблицы в соответствии с исполнением операторов.
            if (а * 2 != b) х = а / 2 + b;
            else х = b / 2 + а;
            if (х < 15) System.out.println("X=" + x);
            else System.out.println(x);

            Таблица 1
            -----------------------------------------------------------------------------
            | a          |   10   |   -5   |   12   |   6    |   7    |   14   |    9   |
            | b          |   11   |   10   |   6    |   12   |   7    |   14   |   18   |
            | X          |   5    |    7   |   -1   |   3    |   7    |   -8   |   -2   |
            | На экране  |   16   |   X=8  |  X=12  |  X=12  |  X=10  |   21   |   18   |
            -----------------------------------------------------------------------------

            Таблица 2
            -----------------------------------------------------------------------------
            | a          |   10   |   1    |        |   6    |   7    |   1    |    9   |
            | b          |   7    |   10   |        |   -6   |        |   14   |    1   |
            | X          |   26   |  -10   |        |   0    |        |   14   |    9   |
            | На экране  |  X=12  |  X=10  |  X=30  |  X=-3  |   10   |  X=14  |   X=5  |
            -----------------------------------------------------------------------------
            Невозможно вывести X=30 из за этой строчки:
            if (х < 15) System.out.println("X=" + x);

            Невозможно вывести 10 из за этих строчек:
            if (х < 15) System.out.println("X=" + x);
            else System.out.println(x);
         */
    }
}
