package section_13_for_loop_using_the_adder;

public class Task_13_1 {

    public void action() {
        /*
            Задание: Дан следующий фрагмент класса:
            int s1 = 0;
            int s2 = 0;
            for(int i = 1; i < 7; i++) {
                int x = reader.nextInt();
                if(х % 2 == 0) s1 = s1 + x;
                if(х % 3 == 0) s2 = s2 + x;
            }

            Проследите за выполнением фрагмента и запишите, какими будут
            значения переменных s1 и s2 для следующего набора вводимых данных
            после его окончания: 5, 12, 6, 8, 9, 7.
            ------------------------------------------------------------------------------------------
                 5  12  6   8   9   7
            s1 : 0, 12, 18, 26, 26, 26
            s2 : 0, 12, 18, 18, 27, 27
         */
    }
}
