package section_13_for_loop_using_the_adder;

import java.util.Scanner;

/*
    Задание: В школе решено создать два специализированных класса: физико-математический
    и физико-информационный. Ученик, желающий поступить в
    один из этих классов, должен иметь среднюю оценку (по 10-балльной системе)
    не менее 7. В случае, когда его оценка по математике выше оценки по
    информатике, его зачисляют в физико-математический класс; при ином
    соотношении этих оценок его зачисляют в физико-информационный класс.
    Напишите класс, который принимает с клавиатуры оценки по математике
    и информатике 40 желающих учиться в одном из этих специализированных классов.
    Для каждого из кандидатов следует определить: может ли он быть зачислен
    в один из классов, и если да, — то в какой.
    По результатам проверки данных каждого кандидата следует вывести
    на экран соответствующее текстовое сообщение.
 */
public class Task_13_31 {

    public void action() {
        Scanner scanner = new Scanner(System.in);

        for (int i = 1; i <= 40; i++) {
            System.out.println("Кандидат " + i + ":");
            System.out.print("Оценка по математике: ");
            int mathGrade = scanner.nextInt();
            System.out.print("Оценка по информатике: ");
            int informaticsGrade = scanner.nextInt();

            if (mathGrade >= 7 && informaticsGrade >= 7) {
                if (mathGrade > informaticsGrade) {
                    System.out.println("Может быть зачислен в физико-математический класс.");
                } else {
                    System.out.println("Может быть зачислен в физико-информационный класс.");
                }
            } else {
                System.out.println("Не может быть зачислен ни в один из классов.");
            }

            System.out.println();
        }

        scanner.close();
    }
}
