package section2_input_commands_output_commands;

public class Task2_6 {
    /*
        Задание: Дан класс:
        import java.util.*;

        class main {
            static Scanner reader = new Scanner(System.in);
            public static void main(String[] args) {
                int a = reader.nextInt();
                System.out.print(" " + (a));
                System.out.print(" " + (a + 1));
                System.out.print(" " + (a - 2));
            }
        }

        1. Укажите, какая информация будет выводиться на экран, если
           с клавиатуры введено значение 8? Объясните ответ.
           ------------------------------------------------------------------------------------------
           Будет выведено 8, 9 и 6 потому что a = 8, 8 + 1 = 9 и 8 - 2 = 6


        2. Укажите, какая информация будет выводиться на экран, если
           с клавиатуры введено значение О? Объясните ответ.
           ------------------------------------------------------------------------------------------
           Будет выведено 0, 1 и -2 потому что a = 0, 0 + 1 = 1 и 0 - 2 = -2


        3. Предложите изменения в программе, чтобы ввод и вывод выглядели более «дружественно».
           ------------------------------------------------------------------------------------------
           Стоит добавить перед вводом цифры следующую строчку:
           System.out.println("Введите целое число:");


        4. На экране выведены отрицательные и положительные числа.
           Какое число было введено? Обоснуйте свой ответ.
           ------------------------------------------------------------------------------------------
           1 потому что a = 1, 1 + 1 = 2 и 1 - 2 = -1
     */
}
