package section2_input_commands_output_commands;

public class Task2_7 {

    /*
        Задние: Дан класс:

        import java.util.*;
        public class Main {
            static Scanner reader = new Scanner(System.in);
            public static void main(String[] args) {
                int a = reader.nextInt();
                System.out.println(a - 10a);
            }
        }

        ПРИМЕЧАНИЕ: В выводе не стоит знак умножения и из-за этого будет ошибка компиляция.
                    Скорее всего это опечатка

        1. Укажите, какая информация будет выводиться на экран, если с
           клавиатуры введено значение 100? Объясните ответ.
           ------------------------------------------------------------------------------------------
            -900 потому что 100 - 10 * (100) = -900


        2. Укажите, какая информация будет выводиться на экран, если с
           клавиатуры введено значение -1? Объясните ответ.
           ------------------------------------------------------------------------------------------
           9 потому что -1 - 10 * (-1) = 9
     */
}
