package section2_input_commands_output_commands;

public class Task2_4 {

    public void example2_4() {
        /*
            Задание: Напишите класс, который выводит на экран тем же количеством команд знаки,
            которые выводились в задании №3, но все знаки должны выводиться в одной строке.
         */
        System.out.println("+++!!!!??");

        // ИЛИ

        String plus = "+++";
        String exclamationMark = "!!!!";
        String questionMark = "??";
        System.out.println(plus + exclamationMark + questionMark);
    }
}
