package section2_input_commands_output_commands;

/*
    Задание: Напишите класс, который выводит на экран надпись "Hello, world!".
*/
public class Task_2_1 {

    public void action() {
        System.out.println("Hello, world!");

        // ИЛИ
        String hello = "Hello, world!";
        System.out.println(hello);
    }
}
