package section2_input_commands_output_commands;

public class Task2_5 {

    /*
        Задание: Дан класс:
        import java.util.;

        public class Main {
            static Scanner reader = new Scanner(System.in);
            public static void main(String[] args) {
                int a = reader.nextInt();
                System.out.println("aa= " + (a * a));
                System.out.println("a10= " + (a * 10));
            }
        }

        1. Укажите, какая информация будет выводиться на экран, если с
           клавиатуры введено значение 6? Объясните ответ.
           ------------------------------------------------------------------------------------------
           Будет выведено 36 и 60 потому что 6 * 6 = 36 и 6 * 10 = 60


        2. Укажите, какая информация будет выводиться на экран,
           если с клавиатуры введено значение -6? Объясните ответ.
           ------------------------------------------------------------------------------------------
           Будет выведено 36 и -60 потому что -6 * -6 = 36 и -6 * 10 = -60


        3. Предложите изменения в программе, чтобы ввод и вывод выглядели более «дружественно».
           ------------------------------------------------------------------------------------------
           Стоили бы добавить строку текста, чтобы пользователь знал что ему вводить, например:
           System.out.println("Введите целое число:");
     */
}
