package section6_simple_if_without_else_and_with_a_single_condition;

public class Task_6_3 {

    public void action() {
        /*
        Задание: Дан класс (программа):

            import java.util.;
            class IfSample3 {
                static Scanner reader = new Scanner(System.in);
                public static void main(String[] args) {
                    int age;
                    System.out.print("Введи свой возраст");
                    age = input.nextInt();
                    if (age >= 18) System.out.println("Можешь участвовать в выборах");
                }
           }

           1. Что будет выведено на экран, если с клавиатуры введено значение 8?
              ------------------------------------------------------------------------------------------
              Введи свой возраст


           2. Что будет выведено на экран, если с клавиатуры введено значение 19?
              ------------------------------------------------------------------------------------------
              Введи свой возраст
              Можешь участвовать в выборах


           3. Что будет выведено на экран, если с клавиатуры введено значение 18?
              ------------------------------------------------------------------------------------------
              Введи свой возраст
              Можешь участвовать в выборах


           4. Приведите пример значения, которое надо ввести с клавиатуры,
              чтобы на экран выводилось сообщение Можешь участвовать в выборах.
              ------------------------------------------------------------------------------------------
              25


           5. Приведите пример значения, которое надо ввести с клавиатуры,
              чтобы на экран не выводилось сообщение Можешь участвовать в выборах.
              ------------------------------------------------------------------------------------------
              13


           6. Как надо изменить код класса, чтобы кроме сообщения Можешь
              участвовать в выборах выводилось на экран - в нужных случаях!
              - сообщение Не можешь участвовать в выборах?
              ------------------------------------------------------------------------------------------
              Необходимо добавить блок ещё один блок if со следующим кодом:
              if (age <= 17) System.out.println("Не можешь участвовать в выборах")
         */
    }
}
