package section6_simple_if_without_else_and_with_a_single_condition;

public class Task_6_1 {

    public void action() {
        /*
            Задание: Дан класс (программа):

            import java.util.;
            class IfSample1 {
                static Scanner reader = new Scanner(System.in);
                    public static void main(String[] args) {
                        int х = reader.nextInt();
                        int y = reader.nextInt();
                        if (х < у) System.out.println ("х меньше у");
                        if (х == у) System.out.println ("х теперь равна у");
                        if (х > у) System.out.println ("х теперь больше у");
                    }
           }

           1. Что будет выведено на экран, если с клавиатуры введены значения 5 и 9?
              ------------------------------------------------------------------------------------------
              x меньше y


           2. Что будет выведено на экран, если с клавиатуры введены значения 9 и 9?
              ------------------------------------------------------------------------------------------
              x теперь равна y


           3. Что будет выведено на экран, если с клавиатуры введены значения 9 и 5?
              ------------------------------------------------------------------------------------------
              x теперь больше y


           4. Приведите пример вводимых с клавиатуры данных, для которых на
              экран будет выведено сообщение х меньше у.
              ------------------------------------------------------------------------------------------
              1 и 2


           5. Приведите пример вводимых с клавиатуры данных, для которых
              на экран будет выведено сообщение х теперь больше у.
              ------------------------------------------------------------------------------------------
              5 и 4


           6. Приведите пример вводимых с клавиатуры данных, для которых
              на экран будет выведено сообщение х теперь меньше у.
              ------------------------------------------------------------------------------------------
              Скорее всего опечатка, ни в одном System.out.println() нет такого текста
         */
    }
}
