package section6_simple_if_without_else_and_with_a_single_condition;

public class Task_6_2 {

    public void action() {
        /*
            Задание: Дан класс (программа):

            import java.util.;
            class IfSample2 {
                static Scanner reader = new Scanner(System.in);
                public static void main(String[] args) {
                    double num;
                    System.out.println ("enter number");
                    num = input.nextDouble();
                    if (num > 0) System.out.println("Положительное число");
                    System.out.println ("Завершено");
                }
           }

           1. Что будет выведено на экран, если с клавиатуры введено значение 8?
              ------------------------------------------------------------------------------------------
              enter number
              Положительное число
              Завершено


           2. Что будет выведено на экран, если с клавиатуры введено значение -9?
              ------------------------------------------------------------------------------------------
              enter number
              Завершено


           3. Что будет выведено на экран, если с клавиатуры введено значение О?
              ------------------------------------------------------------------------------------------
              enter number
              Завершено


           4. Приведите пример значения, которое надо ввести с клавиатуры,
              чтобы на экран выводилось сообщение Положительное число.
              ------------------------------------------------------------------------------------------
              4


           5. Приведите пример значения, которое надо ввести с клавиатуры,
              чтобы на экран не выводилось сообщение Положительное число.
              ------------------------------------------------------------------------------------------
              -1


           6. Почему на экран всегда выводится сообщение Завершено?
              ------------------------------------------------------------------------------------------
              Для вывода данного текста нет никаких условий, поэтому текст
              Завершено выводится в любом случае


           7. Как надо изменить код класса, чтобы сообщение Завершено выводилось
              на экран только вместе с сообщением Положительное число?
             ------------------------------------------------------------------------------------------
             Необходимо команду System.out.println ("Завершено"); переместить
             в блок if к команде System.out.println("Положительное число");
         */
    }
}
