package section5_logical_type;

public class Task_5_1 {

    public void action() {
        /*
            Задание:
            Переменные, используемые в задании, инициированы следующим образом:
            int а = О, b = -3, с = 9;
            Заполните таблицы (в столбце Значение выражения следует написать
            false или true):
            ------------------------------------------------------------------------------------------
            (a + b) * 3 == -9  |  true
            b * a == c * (-a)  |  true
            c / b == b * (-1)  |  false
            (-b) * (-b) >= c   |  true
            b / (-c) == 1 / b  |  true
            80 >= 80           |  true
            b * b != a * c     |  true
            b < a              |  true
            b * b == c         |  true
            -c / b == -b       |  true
         */
    }
}
