package section5_logical_type;

public class Task_5_5 {

    public void action() {
        /*
            Задание: Дано логическое выражение:
            ((z > x) || (x < O)) && (z - y > 9)
            Чему равно значение этого выражения для следующих значений переменных:
            х = -2; y = 5; z = 13?
            ------------------------------------------------------------------------------------------
            Ответ будет false, пояснение:
            1. ((13 > -2) || (-2 < 0)) && (13 - 5 > 9)
            2. (true || true) && false
            3. true && false
            4. false
         */
    }
}
