package section5_logical_type;

public class Task_5_2 {

    public void action() {
        /*
            Задание: Напишите соответствующие выражения на языке Java для словесных
            описаний, приведенных в таблице (имена для переменных выберите самостоятельно):
            ------------------------------------------------------------------------------------------
            Значение переменной больше 90            |  a > 90

            Оценка - не меньше 75                    |  a >= 75

            Разница между значениями отлична от 0    |  a1 - a2 != 0

            Значение не превышает 200                |  a < 200

            Значение хотя бы не больше 120           |  a <= 120

            Значение одной переменной равно сумме
            значений двух других переменных          |  a1 == a2 + a3
         */
    }
}
