package section7_simple_if_with_else_and_with_a_single_condition;

import java.util.Scanner;

public class Task_7_2 {

    public void action() {
        /*
            Задание: Дан программный блок (часть программы):

            int a = reader.nextInt();
            int digit1 = a / 10;
            int digit2 = a % 10;
            if (digit1 == digit1) System.out.println();
            else System.out.println();

            1. Заполните недостающие текстовые сообщения (в скобках) в соответствии
               со смыслом получаемых результатов.
               ПРИМЕЧАНИЕ: скорее всего в задании опечатка и должно быть
               if (digit1 == digit2)
               ------------------------------------------------------------------------------------------
               if (digit1 == digit2) System.out.println("Первая цифра равно последней цифре");
               else System.out.println("Цифры не равны");


            2. Приведите несколько примеров вводимых с клавиатуры выражений,
               для которых на экран выводятся соответствующие текстовые сообщения.
               ------------------------------------------------------------------------------------------
               22, 44, 56
         */
    }
}
