package section7_simple_if_with_else_and_with_a_single_condition;

import java.util.Scanner;

public class Task_7_4 {

    public void action() {
        /*
            Задание: Дан фрагмент класса (программный блок):
            x = reader.nextInt();
            а = х % 100;
            if (х == а) System.out.print("Ok");
            else System.out.print("No");
            Ответьте на вопросы в соответствии с исполнением этого фрагмента:
            1. Какая информация будет выведена на экран, если с клавиатуры
               будет введено значение 165? Обоснуйте ответ.
            ------------------------------------------------------------------------------------------
               No, 65 не равен 165


            2. Какая информация будет выведена на экран, если с клавиатуры
               будет введено значение 5555? Обоснуйте ответ.
            ------------------------------------------------------------------------------------------
               No, 55 не равен 5555


            3. Приведите пример значения, вводимого с клавиатуры, для которого
               на экран будет выведена информация Ok.
            ------------------------------------------------------------------------------------------
               11


            4. Какими должны быть вводимые с клавиатуры значения, чтобы на
               экран выводилось сообщение Ok.
            ------------------------------------------------------------------------------------------
               Двузначными и быть кратными 11
         */
    }
}
