package section7_simple_if_with_else_and_with_a_single_condition;

import java.util.Scanner;

public class Task_7_1 {

    public void action() {
        /*
            Задание: «Переведите» словесные описания в команды на языке Java:
               ------------------------------------------------------------------------------------------
            1. Если значение переменной avg равно 100, то выведи на экран сообщение Молодец
               ------------------------------------------------------------------------------------------
               if (avg == 100) System.out.println("Молодец");


            2. Если значение переменной mark меньше 60, то увеличить это значение на 10%
               ------------------------------------------------------------------------------------------
               if (mark < 60) mark * 1.1;


            3. Если значение переменной one больше значения переменной two, то вывести на экран
               значение one; в противном случае - вывести на экран значение переменной two
               ------------------------------------------------------------------------------------------
               if (one > two) System.out.println(one);
               else System.out.println(two);


            4. Если значение переменной num больше нуля, то вывести на экран сообщение Положительное.
               Если значение переменной num меньше нуля, то вывести на экран сообщение Отрицательное.
               ------------------------------------------------------------------------------------------
               if (num > 0) System.out.println("Положительное");
               if (num < 0) System.out.println("Отрицательное");

            5. Если сумма переменных ugol1, ugol2 и ugol3 составляет 180, то вывести на
               экран сообщение Это уrлы одноrо треуrольника; в противном случае
               вывести на экран сообщение Это не уrлы одноrо треуrольника
               ------------------------------------------------------------------------------------------
               if (ugol1 + ugol2 + ugol3 == 180) System.out.println("Это углы одного треугольника");
               else System.out.println("Это не углы одного треугольника");
         */
    }
}
